extends Control
var دشواری‌ها :Dictionary = {
	0: {
		"شمارگان": 1,
		"امتیاز": 0,
		"علامت": false,
		"کران پایین": 0,
		"کران بالا": 100
	}, 1: {
		"شمارگان": 2,
		"امتیاز": 5,
		"علامت": false,
		"کران پایین": 0,
		"کران بالا": 100
	}, 2: {
		"شمارگان": 2,
		"امتیاز": 20,
		"علامت": true,
		"کران پایین": 0,
		"کران بالا": 100
	}, 3: {
		"شمارگان": 2,
		"امتیاز": 40,
		"علامت": true,
		"کران پایین": 0,
		"کران بالا": 100,
		"تفریق": true
	}, 4: {
		"شمارگان": 3,
		"امتیاز": 60,
		"علامت": true,
		"کران پایین": 0,
		"کران بالا": 100,
		"تفریق": true
	}, 5: {
		"شمارگان": 2,
		"امتیاز": 100,
		"ضرب": {
			"کران پایین": 0,
			"کران بالا": 10,
		}
	}, 6: {
		"شمارگان": 3,
		"امتیاز": 105,
		"علامت": true,
		"کران پایین": 0,
		"کران بالا": 100,
		"تفریق": true,
		"ضرب": {
			"کران پایین": 0,
			"کران بالا": 10,
		}
	}, 7: {
		"شمارگان": 3,
		"امتیاز": 150,
		"علامت": true,
		"کران پایین": 0,
		"کران بالا": 100,
		"تفریق": true,
		"ضرب": {
			"کران پایین": 0,
			"کران بالا": 20,
		}
	}, 8: {
		"شمارگان": 3,
		"امتیاز": 200,
		"علامت": true,
		"کران پایین": 0,
		"کران بالا": 100,
		"تفریق": true,
		"ضرب": {
			"کران پایین": 0,
			"کران بالا": 30,
		}
	}, 9: {
		"شمارگان": 3,
		"امتیاز": 300,
		"علامت": true,
		"کران پایین": 0,
		"کران بالا": 100,
		"تفریق": true,
		"ضرب": {
			"کران پایین": 0,
			"کران بالا": 40,
		}
	}, 10: {
		"شمارگان": 3,
		"امتیاز": 100,
		"علامت": true,
		"کران پایین": 0,
		"کران بالا": 400,
		"تفریق": true,
		"ضرب": {
			"کران پایین": 0,
			"کران بالا": 50,
		}
	}, 11: {
		"شمارگان": 3,
		"امتیاز": 100,
		"علامت": true,
		"کران پایین": 0,
		"کران بالا": 1000,
		"تفریق": true,
		"ضرب": {
			"کران پایین": 0,
			"کران بالا": 100,
		}
	}
}
var دشواری :int = 0
var پاداش_پنج_بار_درست :int = 10
var پنج_حرکت :Array[bool] = []
var پاداش_یک_نادرست :int = -3


func _process(س :float):
	$"سر/زمان".text = "زمان: {0}".format([پارسی‌سازی.شماره_پارسی(str(int($"شمارشگر".time_left)))])
	if $"شمارشگر".time_left <= 0:
		پایان_بازی()


func _ready():
	بازی.امتیاز = 0
	var پیکربندی :ConfigFile = ConfigFile.new()
	var خطا :Error = پیکربندی.load(بازی.نام_پرونده_پیکربندی)
	if خطا == OK:
		دشواری = پیکربندی.get_value("بازی بیشتر", "دشواری", 0)
	theme = بازی.سبک_برگزیده
	await $"شمارش".آغاز
	پیشروی()


func پایان_بازی():
	get_tree().paused = true
	$"سر".hide()
	$"تن".hide()
	$"پا".hide()
	$"ایستاده/ادامه".hide()
	$"ایستاده".show()


func بررسی_پنج_حرکت(حرکت :bool):
	return حرکت


func پیشروی(اندیس :int = -1):
	if اندیس == 2:  # شماره روی برچسب‌ها برابرند
		if $"تن".get_child(0).name == $"تن".get_child(1).name:
			بازی.امتیاز += 1
			$آوا.سردادن("درست")
			پنج_حرکت.append(true)
		else:
			$"شمارشگر".start($"شمارشگر".time_left + پاداش_یک_نادرست)
			$آوا.سردادن("نادرست")
			پنج_حرکت.clear()
	elif اندیس == 1:  # برچسب پایینی شماره بزرگتری دارد
		if int($"تن".get_child(1).name) > int($"تن".get_child(0).name):
			بازی.امتیاز += 1
			$آوا.سردادن("درست")
			پنج_حرکت.append(true)
		else:
			$"شمارشگر".start($"شمارشگر".time_left + پاداش_یک_نادرست)
			$آوا.سردادن("نادرست")
			پنج_حرکت.clear()
	elif اندیس == 0:  # برچسب بالایی شماره بزرگتری دارد
		if int($"تن".get_child(0).name) > int($"تن".get_child(1).name):
			بازی.امتیاز += 1
			$آوا.سردادن("درست")
			پنج_حرکت.append(true)
		else:
			$"شمارشگر".start($"شمارشگر".time_left + پاداش_یک_نادرست)
			$آوا.سردادن("نادرست")
			پنج_حرکت.clear()
	if len(پنج_حرکت) == 5:
		$"شمارشگر".start($"شمارشگر".time_left + پاداش_پنج_بار_درست)
		پنج_حرکت.clear()
	if دشواری != 11:
		if بازی.امتیاز == دشواری‌ها[دشواری + 1]["امتیاز"]:
			دشواری += 1
	if دشواری == 0:
		var شماره۱ :int = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
		var شماره۲ :int = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
		$"تن".get_child(0).name = str(شماره۱)
		$"تن".get_child(1).name = str(شماره۲)
		$"تن".get_child(0).text = پارسی‌سازی.شماره_پارسی(str(شماره۱))
		$"تن".get_child(1).text = پارسی‌سازی.شماره_پارسی(str(شماره۲))
	elif دشواری == 1:
		for بچه in $"تن".get_children():
			var دوشماره_باشد :bool = [true, false].pick_random()
			if دوشماره_باشد:
				var شماره۱ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				var شماره۲ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				var پاسخ = شماره۱ + شماره۲
				بچه.text = "{0} ➕ {1}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱)), پارسی‌سازی.شماره_پارسی(str(شماره۲))])
				بچه.name = str(پاسخ)
			else:
				var شماره = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				بچه.text = پارسی‌سازی.شماره_پارسی(str(شماره))
				بچه.name = str(شماره)
	elif دشواری == 2:
		for بچه in $"تن".get_children():
			var دوشماره_باشد :bool = [true, false].pick_random()
			if دوشماره_باشد:
				var شماره۱ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				var منفی_باشد۱ = [1, -1].pick_random()
				شماره۱ *= منفی_باشد۱
				var شماره۲ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				var منفی_باشد۲ = [1, -1].pick_random()
				شماره۲ *= منفی_باشد۲
				var پاسخ = شماره۱ + شماره۲
				بچه.text = "{0} ➕ {1}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱), true), پارسی‌سازی.شماره_پارسی(str(شماره۲), true)])
				بچه.name = str(پاسخ)
			else:
				var شماره = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				var منفی_باشد = [1, -1].pick_random()
				شماره *= منفی_باشد
				بچه.text = پارسی‌سازی.شماره_پارسی(str(شماره), true)
				بچه.name = str(شماره)
	elif دشواری == 3:
		for بچه in $"تن".get_children():
			var دوشماره_باشد :bool = [true, false].pick_random()
			var تفریق_باشد :bool = [true, false].pick_random()
			if دوشماره_باشد:
				var شماره۱ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				var منفی_باشد۱ = [1, -1].pick_random()
				شماره۱ *= منفی_باشد۱
				var شماره۲ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				var منفی_باشد۲ = [1, -1].pick_random()
				شماره۲ *= منفی_باشد۲
				if تفریق_باشد:
					var پاسخ = شماره۱ - شماره۲
					بچه.text = "{0} ➖ {1}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱), true), پارسی‌سازی.شماره_پارسی(str(شماره۲), true)])
					بچه.name = str(پاسخ)
				else:
					var پاسخ = شماره۱ + شماره۲
					بچه.text = "{0} ➕ {1}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱), true), پارسی‌سازی.شماره_پارسی(str(شماره۲), true)])
					بچه.name = str(پاسخ)
			else:
				var شماره = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				var منفی_باشد = [1, -1].pick_random()
				شماره *= منفی_باشد
				بچه.text = پارسی‌سازی.شماره_پارسی(str(شماره), true)
				بچه.name = str(شماره)
	elif دشواری == 4:
		for بچه in $"تن".get_children():
			var چندشماره_باشد :int = randi_range(1, دشواری‌ها[دشواری]["شمارگان"] + 1)
			if چندشماره_باشد == 1:
				var شماره = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				var منفی_باشد = [1, -1].pick_random()
				شماره *= منفی_باشد
				بچه.text = پارسی‌سازی.شماره_پارسی(str(شماره), true)
				بچه.name = str(شماره)
			elif چندشماره_باشد == 2:
				var تفریق_باشد :bool = [true, false].pick_random()
				var شماره۱ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				var منفی_باشد۱ = [1, -1].pick_random()
				شماره۱ *= منفی_باشد۱
				var شماره۲ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				var منفی_باشد۲ = [1, -1].pick_random()
				شماره۲ *= منفی_باشد۲
				if تفریق_باشد:
					var پاسخ = شماره۱ - شماره۲
					بچه.text = "{0} ➖ {1}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱), true), پارسی‌سازی.شماره_پارسی(str(شماره۲), true)])
					بچه.name = str(پاسخ)
				else:
					var پاسخ = شماره۱ + شماره۲
					بچه.text = "{0} ➕ {1}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱), true), پارسی‌سازی.شماره_پارسی(str(شماره۲), true)])
					بچه.name = str(پاسخ)
			elif چندشماره_باشد == 3:
				var شماره۱ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				var منفی_باشد۱ = [1, -1].pick_random()
				شماره۱ *= منفی_باشد۱
				var شماره۲ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				var منفی_باشد۲ = [1, -1].pick_random()
				شماره۲ *= منفی_باشد۲
				var شماره۳ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
				var منفی_باشد۳ = [1, -1].pick_random()
				شماره۳ *= منفی_باشد۳
				var تفریق_باشد۱ = [true, false].pick_random()
				var تفریق_باشد۲ = [true, false].pick_random()
				var پاسخ
				if تفریق_باشد۱ and تفریق_باشد۲:
					پاسخ = شماره۱ - شماره۲ - شماره۳
					بچه.text = "{0} ➖ {1} ➖ {2}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱)), پارسی‌سازی.شماره_پارسی(str(شماره۲)), پارسی‌سازی.شماره_پارسی(str(شماره۳))])
				elif تفریق_باشد۱ and !تفریق_باشد۲:
					پاسخ = شماره۱ - شماره۲ + شماره۳
					بچه.text = "{0} ➖ {1} ➕ {2}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱)), پارسی‌سازی.شماره_پارسی(str(شماره۲)), پارسی‌سازی.شماره_پارسی(str(شماره۳))])
				elif !تفریق_باشد۱ and تفریق_باشد۲:
					پاسخ = شماره۱ + شماره۲ - شماره۳
					بچه.text = "{0} ➕ {1} ➖ {2}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱)), پارسی‌سازی.شماره_پارسی(str(شماره۲)), پارسی‌سازی.شماره_پارسی(str(شماره۳))])
				elif !تفریق_باشد۱ and !تفریق_باشد۲:
					پاسخ = شماره۱ + شماره۲ + شماره۳
					بچه.text = "{0} ➕ {1} ➕ {2}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱)), پارسی‌سازی.شماره_پارسی(str(شماره۲)), پارسی‌سازی.شماره_پارسی(str(شماره۳))])
				بچه.name = str(پاسخ)
	elif دشواری == 5:
		for بچه in $"تن".get_children():
			var شماره۱ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
			var شماره۲ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
			var پاسخ = شماره۱ * شماره۲
			بچه.name = str(پاسخ)
			بچه.text = "{0} ✖️ {1}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱)), پارسی‌سازی.شماره_پارسی(str(شماره۲))])
	elif دشواری >= 6:
		var چندشماره_باشد :int = randi_range(2, دشواری‌ها[دشواری]["شمارگان"] + 1)
		if چندشماره_باشد == 3:
			for بچه in $"تن".get_children():
				var کار۱ = ["جمع", "تفریق", "ضرب"].pick_random()
				if کار۱ == "جمع":
					var پرانتز = [true, false].pick_random()
					if پرانتز:
						var شماره۱ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
						var منفی_باشد۱ = [1, -1].pick_random()
						شماره۱ *= منفی_باشد۱
						var شماره۲ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
						var منفی_باشد۲ = [1, -1].pick_random()
						شماره۲ *= منفی_باشد۲
						var شماره۳ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
						var پاسخ = (شماره۱ + شماره۲) * شماره۳
						بچه.name = str(پاسخ)
						بچه.text = "({0} ➕ {1}) ✖️ {2}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱), true), پارسی‌سازی.شماره_پارسی(str(شماره۲), true), پارسی‌سازی.شماره_پارسی(str(شماره۳))])
					else:
						var شماره۱ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
						var شماره۲ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
						var شماره۳ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
						var پاسخ = شماره۱ + شماره۲ * شماره۳
						بچه.name = str(پاسخ)
						بچه.text = "{0} ➕ {1} ✖️ {2}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱)), پارسی‌سازی.شماره_پارسی(str(شماره۲)), پارسی‌سازی.شماره_پارسی(str(شماره۳))])
				elif کار۱ == "تفریق":
					var پرانتز = [true, false].pick_random()
					if پرانتز:
						var شماره۱ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
						var منفی_باشد۱ = [1, -1].pick_random()
						شماره۱ *= منفی_باشد۱
						var شماره۲ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
						var منفی_باشد۲ = [1, -1].pick_random()
						شماره۲ *= منفی_باشد۲
						var شماره۳ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
						var پاسخ = (شماره۱ - شماره۲) * شماره۳
						بچه.name = str(پاسخ)
						بچه.text = "({0} ➖ {1}) ✖️ {2}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱), true), پارسی‌سازی.شماره_پارسی(str(شماره۲), true), پارسی‌سازی.شماره_پارسی(str(شماره۳))])
					else:
						var شماره۱ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
						var شماره۲ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
						var شماره۳ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
						var پاسخ = شماره۱ - شماره۲ * شماره۳
						بچه.name = str(پاسخ)
						بچه.text = "{0} ➖ {1} ✖️ {2}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱)), پارسی‌سازی.شماره_پارسی(str(شماره۲)), پارسی‌سازی.شماره_پارسی(str(شماره۳))])
				elif کار۱ == "ضرب":
					var کار۲ = ["جمع", "تفریق", "ضرب"].pick_random()
					if کار۲ == "جمع":
						var پرانتز = [true, false].pick_random()
						if پرانتز:
							var شماره۱ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
							var شماره۲ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
							var منفی_باشد۱ = [1, -1].pick_random()
							شماره۲ *= منفی_باشد۱
							var شماره۳ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
							var منفی_باشد۲ = [1, -1].pick_random()
							شماره۳ *= منفی_باشد۲
							var پاسخ = شماره۱ * (شماره۲ + شماره۳)
							بچه.name = str(پاسخ)
							بچه.text = "{0} ✖️ ({1} ➕ {2})".format([پارسی‌سازی.شماره_پارسی(str(شماره۱)), پارسی‌سازی.شماره_پارسی(str(شماره۲), true), پارسی‌سازی.شماره_پارسی(str(شماره۳), true)])
						else:
							var شماره۱ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
							var شماره۲ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
							var شماره۳ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
							var منفی_باشد۲ = [1, -1].pick_random()
							شماره۳ *= منفی_باشد۲
							var پاسخ = شماره۱ * شماره۲ + شماره۳
							بچه.name = str(پاسخ)
							بچه.text = "{0} ✖️ {1} ➕ {2}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱)), پارسی‌سازی.شماره_پارسی(str(شماره۲)), پارسی‌سازی.شماره_پارسی(str(شماره۳), true)])
					elif کار۲ == "تفریق":
						var پرانتز = [true, false].pick_random()
						if پرانتز:
							var شماره۱ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
							var شماره۲ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
							var منفی_باشد۱ = [1, -1].pick_random()
							شماره۲ *= منفی_باشد۱
							var شماره۳ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
							var منفی_باشد۲ = [1, -1].pick_random()
							شماره۳ *= منفی_باشد۲
							var پاسخ = شماره۱ * (شماره۲ - شماره۳)
							بچه.name = str(پاسخ)
							بچه.text = "{0} ✖️ ({1} ➖ {2})".format([پارسی‌سازی.شماره_پارسی(str(شماره۱)), پارسی‌سازی.شماره_پارسی(str(شماره۲), true), پارسی‌سازی.شماره_پارسی(str(شماره۳), true)])
						else:
							var شماره۱ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
							var شماره۲ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
							var شماره۳ = randi_range(دشواری‌ها[دشواری]["کران پایین"], دشواری‌ها[دشواری]["کران بالا"])
							var منفی_باشد۲ = [1, -1].pick_random()
							شماره۳ *= منفی_باشد۲
							var پاسخ = شماره۱ * شماره۲ - شماره۳
							بچه.name = str(پاسخ)
							بچه.text = "{0} ✖️ {1} ➖ {2}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱)), پارسی‌سازی.شماره_پارسی(str(شماره۲)), پارسی‌سازی.شماره_پارسی(str(شماره۳), true)])
					elif کار۲ == "ضرب":# ➕ ➖ ✖️ ➗
						var شماره۱ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
						var شماره۲ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
						var شماره۳ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
						var پاسخ = شماره۱ * شماره۲ * شماره۳
						بچه.name = str(پاسخ)
						بچه.text = "{0} ✖️ {1} ✖️ {2}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱)), پارسی‌سازی.شماره_پارسی(str(شماره۲)), پارسی‌سازی.شماره_پارسی(str(شماره۳))])
		elif چندشماره_باشد == 2:
			for بچه in $"تن".get_children():
				var شماره۱ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
				var شماره۲ = randi_range(دشواری‌ها[دشواری]["ضرب"]["کران پایین"], دشواری‌ها[دشواری]["ضرب"]["کران بالا"])
				var پاسخ = شماره۱ * شماره۲
				بچه.name = str(پاسخ)
				بچه.text = "{0} ✖️ {1}".format([پارسی‌سازی.شماره_پارسی(str(شماره۱)), پارسی‌سازی.شماره_پارسی(str(شماره۲))])
