extends Control
var فهرست_اشکال :Array[String] = [
	"دایره",
	"مربع",
	"مثلث",
	"ستاره",
	"گل"
]
var شکل_پیش :String = "دایره"
var شکل_پس :String = "گل"


func _process(س :float):
	$"سر/زمان".text = "زمان: {0}".format([پارسی‌سازی.شماره_پارسی(str(int($"شمارشگر".time_left)))])


func _ready():
	بازی.امتیاز = 0
	تغییراشکال("هردو")
	await $"شمارش".آغاز
	$"تن/پویانمایی".play("پویانمایی")


func پایان_بازی():
	get_tree().paused = true
	$سر.hide()
	$"ایستاده/ادامه".hide()
	$"ایستاده".show()
	$تن.hide()
	$پا.hide()


func پیشروی(پاسخ :bool):
	if پاسخ:
		if شکل_پیش == شکل_پس:
			بازی.امتیاز += 1
			$آوا.سردادن("درست")
		else:
			$آوا.سردادن("نادرست")
	else:
		if not شکل_پیش == شکل_پس:
			بازی.امتیاز += 1
			$آوا.سردادن("درست")
		else:
			$آوا.سردادن("نادرست")
	$"تن/پویانمایی".play("RESET")
	تغییراشکال("پیش")
	تغییراشکال("پس")
	$"تن/پویانمایی".play("پویانمایی")


func تغییراشکال(کدام :String = "پس"):
	if کدام == "پس":
		شکل_پس = فهرست_اشکال.pick_random()
		$"تن/پس".texture = load(بازی.فرتوران["شکل"][شکل_پس])
	elif کدام == "هردو":
		شکل_پس = فهرست_اشکال.pick_random()
		$"تن/پس".texture = load(بازی.فرتوران["شکل"][شکل_پس])
		شکل_پیش = فهرست_اشکال.pick_random()
		$"تن/پیش".texture = load(بازی.فرتوران["شکل"][شکل_پیش])
	elif کدام == "پیش":
		شکل_پیش = شکل_پس
		$"تن/پیش".texture = load(بازی.فرتوران["شکل"][شکل_پس])
