extends Control
## نخستین صفحه بازی.
##
## کار این فرداد آغاز بازی برگزیده بازیکن می‌باشد،
## کارهای پیکربندی و درباره‌ما هم می‌کند.
##
## @tutorial:             https://github.com/mojtabavahidinasab/conscious/TODO

## برابر پارسی «audio» آویس می‌باشد. هنگام فشردن دکمه‌های برگشت و ایستادن، آویسی شانسی پخش خواهد شد.
var آویس‌های_دکمه = []

# نمونه فرداد برای بومی‌سازی رابط کاربری بازی در فردایی TODO
#var زبان = "پارسی"
#if language == "خودکار":
	#var زبان_کاربر = OS.get_locale_language()
	#TranslationServer.set_locale(زبان_کاربر)
#else:
	#TranslationServer.set_locale(زبان)


## در آغازبازی یکبار متن‌های برچسب‌ها را دگرگون ساز.
## تا با هر بازآغاز همان متن‌های بازی پیش بازگو نگردند.
## نام این تابع یک واژه کلیدی می‌باشد برای همین نمی‌توان نامی فارسی جایگزین آن نمود.
func _ready():
	
	# اینها را نمی‌شد خارج از تابع نوشت. زیرا خطای زیر از این کار ایراد می‌گیرد:
	# Line X:Unexpected identifier "آویس‌های_دکمه" in class body.
	آویس‌های_دکمه.append(preload("res://جلوه آویسی/دکمه/بشکن۱.wav"))
	آویس‌های_دکمه.append(preload("res://جلوه آویسی/دکمه/بشکن۲.wav"))


## نام این تابع یک واژه کلیدی می‌باشد برای همین نمی‌توان نامی فارسی جایگزین آن نمود.
func _process(delta: float):
	pass


## این تابع آغازگر بازی برگزیده بازیکن است.
## فردا نمایش پیام‌های زیر را پیاده‌سازی می‌کنم
## پیام این بازی در دست توسعه است به همراه دعوت به همکاری TODO
## پیام راهنمای هر بازی به همراه دکمه آغاز TODO
## پیام‌های بخش پیکربندی و درباره ما و دیگر TODO
func آغازبازی(بازی = null):
	$آویس.stream = آویس‌های_دکمه.pick_random()
	$آویس.play()
	if بازی:
		get_tree().change_scene_to_file(بازی)
