extends Control
## نخستین صفحه بازی.
##
## کار این فرداد آغاز بازی برگزیده بازیکن می‌باشد،
## کارهای پیکربندی و درباره‌ما هم می‌کند.
##
## @tutorial:             https://github.com/mojtabavahidinasab/conscious/TODO


# نمونه فرداد برای بومی‌سازی رابط کاربری بازی در فردایی TODO
#var زبان = "پارسی"
#if language == "خودکار":
	#var زبان_کاربر = OS.get_locale_language()
	#TranslationServer.set_locale(زبان_کاربر)
#else:
	#TranslationServer.set_locale(زبان)


## نام این تابع یک واژه کلیدی می‌باشد برای همین نمی‌توان نامی فارسی جایگزین آن نمود.
func _ready():
	var پیکربندی :ConfigFile = ConfigFile.new()
	var خطا :Error = پیکربندی.load("user://{0}".format([بازی.نام_پرونده_پیکربندی]))
	if خطا == OK:
		var سبک = پیکربندی.get_value("پیکربندی", "سبک", "آفتاب")
		var نمایش_درباره_بازی = پیکربندی.get_value("پیکربندی", "نمایش درباره پیش از آغاز بازی", true)
		var پخش_آوا = پیکربندی.get_value("پیکربندی", "پخش آوا", true)
		if سبک == "آفتاب":
			تغییرسبک(0)
		elif سبک == "مهتاب":
			تغییرسبک(1)
			$"پیکربندی/بخش‌ها/سبک/گزینه‌ها".select(1)
		if نمایش_درباره_بازی == true:
			$"پیکربندی/بخش‌ها/نمایش درباره پیش از آغازبازی/دکمه".button_pressed = true
			$"پیکربندی/بخش‌ها/نمایش درباره پیش از آغازبازی/دکمه".text = "بله"
		elif نمایش_درباره_بازی == false:
			$"پیکربندی/بخش‌ها/نمایش درباره پیش از آغازبازی/دکمه".button_pressed = false
			$"پیکربندی/بخش‌ها/نمایش درباره پیش از آغازبازی/دکمه".text = "خیر"
		if پخش_آوا == true:
			$"پیکربندی/بخش‌ها/پخش آوا/دکمه".button_pressed = true
			$"پیکربندی/بخش‌ها/پخش آوا/دکمه".text = "بله"
			بازی.پخش_آوا = true
		elif پخش_آوا == false:
			$"پیکربندی/بخش‌ها/پخش آوا/دکمه".button_pressed = false
			$"پیکربندی/بخش‌ها/پخش آوا/دکمه".text = "خیر"
			بازی.پخش_آوا = false
	theme = بازی.سبک_برگزیده
	# راست‌چین کردن اجباری
	for بخش in $"بازی‌ها/بخش‌ها".get_children():
		for بازی in بخش.get_children():
			if بازی is ScrollContainer:
				بازی.scroll_horizontal = 99999


## این تابع آغازگر بازی برگزیده بازیکن است.
## فردا نمایش پیام‌های زیر را پیاده‌سازی می‌کنم
## پیام این بازی در دست توسعه است به همراه دعوت به همکاری TODO
## پیام راهنمای هر بازی به همراه دکمه آغاز TODO
## پیام‌های بخش پیکربندی و درباره ما و دیگر TODO
func آغازبازی(کدام_بازی = null):
	$آوا.سردادن("دکمه")
	if (کدام_بازی and !$"پیکربندی/بخش‌ها/نمایش درباره پیش از آغازبازی/دکمه".button_pressed) \
	or (کدام_بازی and $"درباره بازی".visible):
		get_tree().change_scene_to_file(کدام_بازی)
	elif کدام_بازی and $"پیکربندی/بخش‌ها/نمایش درباره پیش از آغازبازی/دکمه".button_pressed:
		$"بخش‌ها".hide()
		$"بازی‌ها".hide()
		$"نوار درباره بازی".show()
		$"درباره بازی".show()
		$"درباره بازی/بخش‌ها/متن".text = بازی.درباره_بازی[کدام_بازی]
		$"نوار درباره بازی/آغاز".pressed.connect(آغازبازی.bind(کدام_بازی))


func نمایش_بخش‌ها():
	$آوا.سردادن("دکمه")
	$"بخش‌ها".show()
	$"بازی‌ها".show()
	$"نوار درباره بازی".hide()
	$"درباره بازی".hide()
	$"نوار درباره بازی/آغاز".pressed.disconnect(آغازبازی)


func نمایش‌بخش(بخش: String):
	$آوا.سردادن("دکمه")
	for هربخش in get_children():
		if هربخش is ScrollContainer:
			if هربخش.name == بخش:
				هربخش.show()
			else:
				هربخش.hide()


func تغییرپیکربندی(درونمایه, کلید, سردر):
	$آوا.سردادن("دکمه")
	if کلید == "نمایش درباره پیش از آغاز بازی":
		if درونمایه == false:
			$"پیکربندی/بخش‌ها/نمایش درباره پیش از آغازبازی/دکمه".text = "خیر"
		else:
			$"پیکربندی/بخش‌ها/نمایش درباره پیش از آغازبازی/دکمه".text = "بله"
	elif کلید == "پخش آوا":
		if درونمایه == false:
			$"پیکربندی/بخش‌ها/پخش آوا/دکمه".text = "خیر"
			بازی.پخش_آوا = false
		else:
			$"پیکربندی/بخش‌ها/پخش آوا/دکمه".text = "بله"
			بازی.پخش_آوا = true
	var پیکربندی :ConfigFile= ConfigFile.new()
	var خطا :Error = پیکربندی.load("user://{0}".format([بازی.نام_پرونده_پیکربندی]))
	if خطا == OK:
		پیکربندی.set_value(سردر, کلید, درونمایه)
		پیکربندی.save("user://{0}".format([بازی.نام_پرونده_پیکربندی]))


func تغییرسبک(اندیس: int):
	$آوا.سردادن("آغازبازی")
	var پیکربندی :ConfigFile= ConfigFile.new()
	var خطا :Error = پیکربندی.load("user://{0}".format([بازی.نام_پرونده_پیکربندی]))
	if اندیس == 0:
		RenderingServer.set_default_clear_color(Color.WHITE)
		بازی.سبک_برگزیده = preload(بازی.سبک_آفتاب)  # آفتاب
		theme = بازی.سبک_برگزیده
		if خطا == OK:
			پیکربندی.set_value("پیکربندی", "سبک", "آفتاب")
	elif اندیس == 1:
		RenderingServer.set_default_clear_color(Color.BLACK)
		بازی.سبک_برگزیده = preload(بازی.سبک_مهتاب)  # مهتاب
		theme = بازی.سبک_برگزیده
		if خطا == OK:
			پیکربندی.set_value("پیکربندی", "سبک", "مهتاب")
	if خطا == OK:
		پیکربندی.save("user://{0}".format([بازی.نام_پرونده_پیکربندی]))
