extends Control
var سمت_پرستوی_میانی :String = "چپ"
var سمت_دیگر_پرستوها :String = "چپ"
var پیکربندی_چیدمان :Dictionary = {
"اسلش": {
		"جاگیری": Vector2(-500, 500),
		"چیدمان": {
					1: Vector2(-50, 50),
					2: Vector2(-150, 150),
					3: Vector2(-250, 250),
					4: Vector2(-350, 350),
					5: Vector2(-450, 450),
				}
}, "الف": {
		"جاگیری": Vector2(-100, 500),
		"چیدمان": {
					1: Vector2(-50, 50),
					2: Vector2(-50, 150),
					3: Vector2(-50, 250),
					4: Vector2(-50, 350),
					5: Vector2(-50, 450),
				}
}, "بعلاوه": {
		"جاگیری": Vector2(-300, 300),
		"چیدمان": {
					1: Vector2(-150, 50),
					2: Vector2(-250, 150),
					3: Vector2(-150, 150),
					4: Vector2(-50, 150),
					5: Vector2(-150, 250),
				}
}, "به بالا": {
		"جاگیری": Vector2(-500, 300),
		"چیدمان": {
					1: Vector2(-50, 250),
					2: Vector2(-150, 150),
					3: Vector2(-250, 50),
					4: Vector2(-350, 150),
					5: Vector2(-450, 250),
				}
}, "به راست": {
		"جاگیری": Vector2(-300, 500),
		"چیدمان": {
					1: Vector2(-250, 50),
					2: Vector2(-150, 150),
					3: Vector2(-50, 250),
					4: Vector2(-150, 350),
					5: Vector2(-250, 450),
				}
}, "به پایین": {
		"جاگیری": Vector2(-500, 300),
		"چیدمان": {
					1: Vector2(-50, 50),
					2: Vector2(-150, 150),
					3: Vector2(-250, 250),
					4: Vector2(-350, 150),
					5: Vector2(-450, 50),
				}
}, "به چپ": {
		"جاگیری": Vector2(-300, 500),
		"چیدمان": {
					1: Vector2(-50, 50),
					2: Vector2(-150, 150),
					3: Vector2(-250, 250),
					4: Vector2(-150, 350),
					5: Vector2(-50, 450),
				}
}, "بک اسلش": {
		"جاگیری": Vector2(-500, 500),
		"چیدمان": {
					1: Vector2(-450, 50),
					2: Vector2(-350, 150),
					3: Vector2(-250, 250),
					4: Vector2(-150, 350),
					5: Vector2(-50, 450),
				}
}, "خط تیره": {
		"جاگیری": Vector2(-500, 100),
		"چیدمان": {
					1: Vector2(-50, 50),
					2: Vector2(-150, 50),
					3: Vector2(-250, 50),
					4: Vector2(-350, 50),
					5: Vector2(-450, 50),
				}
}, "ضربدر": {
		"جاگیری": Vector2(-300, 300),
		"چیدمان": {
					1: Vector2(-50, 50),
					2: Vector2(-50, 250),
					3: Vector2(-150, 150),
					4: Vector2(-250, 50),
					5: Vector2(-250, 250),
				}
}, "ن کره‌ای": {
		"جاگیری": Vector2(-300, 300),
		"چیدمان": {
					1: Vector2(-250, 50),
					2: Vector2(-250, 150),
					3: Vector2(-250, 250),
					4: Vector2(-150, 250),
					5: Vector2(-50, 250),
				}
}, "ن کره‌ای وارونه": {
		"جاگیری": Vector2(-300, 300),
		"چیدمان": {
					1: Vector2(-50, 50),
					2: Vector2(-50, 150),
					3: Vector2(-50, 250),
					4: Vector2(-150, 250),
					5: Vector2(-250, 250),
				}
}, "ک کره‌ای": {
		"جاگیری": Vector2(-300, 300),
		"چیدمان": {
					1: Vector2(-250, 50),
					2: Vector2(-150, 50),
					3: Vector2(-50, 50),
					4: Vector2(-50, 150),
					5: Vector2(-50, 250),
				}
}, "ک کره‌ای وارونه": {
		"جاگیری": Vector2(-300, 300),
		"چیدمان": {
					1: Vector2(-50, 50),
					2: Vector2(-150, 50),
					3: Vector2(-250, 50),
					4: Vector2(-250, 150),
					5: Vector2(-250, 250),
				}
}
}


func _process(س :float):
	$"سر/زمان".text = "زمان: {0}".format([پارسی‌سازی.شماره_پارسی(str(int($"شمارشگر".time_left)))])


func _input(رویداد :InputEvent):
	if رویداد is InputEventScreenTouch:
		if رویداد.is_released():
			پیشروی($"مهارلمس".سمت_لمس)


func _ready():
	بازی.امتیاز = 0
	پیشروی()
	await $"شمارش".آغاز
	$"پرستوها".show()


func پایان_بازی():
	$سر.hide()
	$ایستاده.show()
	$"ایستاده/ادامه".hide()
	$"پرستوها".hide()
	get_tree().paused = true


func پیشروی(سمت :String = ""):
	if !سمت.is_empty():
		if سمت == سمت_پرستوی_میانی:
			بازی.امتیاز += 1
			$آوا.سردادن("درست")
		else:
			$آوا.سردادن("نادرست")
	سمت_پرستوی_میانی = ["چپ", "پایین", "بالا", "راست"].pick_random()
	سمت_دیگر_پرستوها = ["چپ", "پایین", "بالا", "راست"].pick_random()
	var چیدمان :String = پیکربندی_چیدمان.keys().pick_random()
	$"پرستوها/چیدمان".play(چیدمان)
	var جا = Vector2(
		randf_range(.0, get_rect().size.x), 
		randf_range($سر.get_rect().size.y, get_rect().size.y))
	var جاگیری :Vector2 = جا + پیکربندی_چیدمان[چیدمان]["جاگیری"]
	if جاگیری.x < 0:
		جا.x -= جاگیری.x
	if جاگیری.y > get_rect().size.y:
		جا.y -= abs(جاگیری.y - get_rect().size.y)
	for بچه in range(1, 5 + 1):
		var پرستو :Sprite2D = get_node("پرستوها/{0}".format([بچه]))
		پرستو.position = جا + پیکربندی_چیدمان[چیدمان]["چیدمان"][بچه]
		if پرستو.name == "3":
			if سمت_پرستوی_میانی == "چپ":
				پرستو.rotation_degrees = 0
			elif سمت_پرستوی_میانی == "پایین":
				پرستو.rotation_degrees = 270
			elif سمت_پرستوی_میانی == "بالا":
				پرستو.rotation_degrees = 90
			elif سمت_پرستوی_میانی == "راست":
				پرستو.rotation_degrees = 180
		else:
			if سمت_دیگر_پرستوها == "چپ":
				پرستو.rotation_degrees = 0
			elif سمت_دیگر_پرستوها == "پایین":
				پرستو.rotation_degrees = 270
			elif سمت_دیگر_پرستوها == "بالا":
				پرستو.rotation_degrees = 90
			elif سمت_دیگر_پرستوها == "راست":
				پرستو.rotation_degrees = 180
